# ZoneExistsNotEnclosedRoom Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ZoneFailures..::..ZoneExistsNotEnclosedRoom Property
BuiltInFailures..::..ZoneFailures Class See Also
---
Zone has a room not enclosed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ZoneExistsNotEnclosedRoom { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ZoneExistsNotEnclosedRoom As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ZoneExistsNotEnclosedRoom {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ZoneFailures Class
Autodesk.Revit.DB Namespace